brew "bash"
brew "bat"
brew "bc"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "glab"
brew "gsed"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "nushell"
brew "pkg-config"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"

tap "rsteube/tap"
brew "carapace"

tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"

# cask applications
tap "buo/cask-upgrade"

cask "1password"
cask "arc"
cask "dbeaver-community"
cask "displaylink"
cask "docker"
cask "font-fira-code"
cask "font-ligature-symbols"
cask "font-material-symbols"
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-powerline-symbols"
cask "font-symbols-only-nerd-font"
cask "google-drive"
cask "insomnia"
cask "karabiner-elements"
cask "kitty"
cask "logi-options-plus"
cask "notion"
cask "visual-studio-code"

# App Store applications
brew "mas"
