brew "bash"
brew "bat"
brew "bc"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "glab"
brew "gs"          # required by `imagemagick` for pdf previewing
brew "gsed"
brew "helm"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "minikube"
brew "mise"
brew "neovim"
brew "nushell"
brew "pkg-config"
brew "pngpaste"
brew "poppler"     # required by `yazi` for pdf previewing
brew "resvg"       # required by `yazi` for svg previewing
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tmux"
brew "yazi"
brew "zoxide"

tap "rsteube/tap"
brew "carapace"

tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"

# cask applications
tap "buo/cask-upgrade"

cask "1password"
cask "1password-cli"
cask "arc"
cask "dbeaver-community"
cask "displaylink"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-ligature-symbols"
cask "font-material-symbols"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-powerline-symbols"
cask "font-symbols-only-nerd-font"
cask "google-drive"
cask "insomnia"
cask "karabiner-elements"
cask "kitty"
cask "logi-options+"
cask "mongodb-compass"
cask "notion"
cask "obsidian"
cask "redis-insight"
cask "visual-studio-code"

# App Store applications
brew "mas"
