bierner.markdown-mermaid
dbaeumer.vscode-eslint
eamodio.gitlens
golang.go
hverlin.mise-vscode
jlcodes.antigravity-cockpit
meta.pyrefly
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
sst-dev.opencode
tamasfe.even-better-toml
thenuprojectcontributors.vscode-nushell-lang
yzhang.markdown-all-in-one
